
/// ----------------------------------------------------------------------------
/// File Name          : com.c
/// Description        : 通讯应用模块(全双工通讯)
///
///     因为使用 OS 资源, 所以放在APP层.
/// ----------------------------------------------------------------------------
/// History:

/// y11/m03/d06     v0.06   chenyong    modify
/// 1   去掉以前多加的一条语句，
/// 函数 COM_9511GetHghEven() 中去掉语句 "rt  =   MOTO_HghGetHeight(BSP_ID_EVEN);"
/// 2   原9511板在进出补绣时，针高不变化. 为修改此问题, 状态切换时，不改变针高. 
/// 更改如下：
///     函数 COM_9511UpStChange()   去掉函数COM_HghUpdate()的调用
///     函数 COM_HghUpdate()        增加返回值, 判断是否完成动作
///     增加变量 COM_HghIsAim[]     记录针高是否与机头开关状态同步
///     函数 COM_9511FaultOff()     增加调用 COM_HghUpdate() 的条件, 针高与机头开关状态不同步则调用
///     函数 COM_9511MAOrgIn()      增加调用 COM_HghUpdate() 的条件, 针高与机头开关状态不同步则调用
///     函数 COM_UpStByKeyUp()      增加调用函数 COM_HghUpdate(), 并记录返回值
///     函数 COM_UpStByKeyMd()      增加调用函数 COM_HghUpdate(), 并记录返回值
///     函数 COM_UpStByKeyDn()      增加调用函数 COM_HghUpdate(), 并记录返回值
/// 3   刺绣时，主控报断线停车, 而没有机头亮红灯.
///     分析为9511上报断线后，主控仍然发现线夹信号.
///     修改函数 COM_9511BrkDetect(), 去掉函数 COM_9511UpStByMARun()的调用, 避免线夹信号清灯
/// 4   断检过于灵敏, 增加函数 COM_XJ_3(), 3此线夹信号调用1次函数 COM_XJ_3.
/// 5   修改针高回复函数. 针高没有运动前, 回复实际针高

/// y10/m12/d22     v0.05   chenyong    modify
/// 加入函数 bool COM_JogIsEn(BSP_ID_TypeDef id), 用于针高电机模块判断能否微动

/// y10/m12/d17     v0.04   chenyong    modify
/// 因为主控有发针高前没有发主轴到位的情况, 修改了COM_HighCmd()函数
/// "跳跃剪线"参数设为否时, 越框前, 主控发不到位, 越框程序中升针高没有被9511执行, 针在下位就越框了
/// 另外, COM_HghUpdate()函数中应加入限制条件 COM_9511MAIsRunning == TRUE,  !!! 目前没有加入 !!!
    
/// y10/m11/d30     v0.03   chenyong    modify
/// 1   改变定义 COM_HGH_NOT_DROP, 原为(10), 改为(MOTO_HGH_POS_UP)
/// 2   修改函数 COM_9511GetHghOdd() 和 COM_9511GetHghEven(), 减少误报"针高不一致"
/// 3   修改函数 COM_9511GetDnErr(), 主轴不转不报断线

/// y10/m08/d27     v0.02   chenyong    modify

/// y10/m08/d06     v0.01   shengjiaq   setup





#define  COM_MODULE     /// 模块定义, 用区分内外部定义


/// Includes --------------------------------------------------------------------------------------------
#include  <bsp.h>
#include  <ucos_ii.h>

#include  "com.h"

#include  "c491.h"
#include  "moto.h"
#include  "in.h"
#include  "hdled.h"
#include "../3ds/crypto_des3.h"
#include "../3ds/bitstream.h"



/// Private define --------------------------------------------------------------------------------------

#define  COM_BIT_ODD(data)              (data & (1 << 1))
#define  COM_BIT_EVE(data)              (data & (1 << 0))

#define  VERSION9511                    3                       /// 1 - 无CRC,  2 - 有CRC

#define  COM_9511_ADDR_ALL              0

#define  COM_MAX_FRAME_LEN              10

#define  COM_BIT_ADDR_9511              7
#define  COM_MSK_9511_WHOLE             ((1 << (COM_BIT_ADDR_9511 + 1)) - 1)//1 0000 0000 -1=0xFF
#define  COM_MSK_9511_DATA              ((1 <<  COM_BIT_ADDR_9511     ) - 1)//1000 0000 -1 =0x3F
#define  COM_BIT_ADDR_924               8
#define  COM_MSK_924_WHOLE              ((1 << (COM_BIT_ADDR_924  + 1)) - 1)
#define  COM_MSK_924_DATA               ((1 <<  COM_BIT_ADDR_924      ) - 1)

/// ------- cy 101007   a   -------
#define  COM_LEN_TAB9511                (sizeof(COM_9511Tbl) / sizeof(COM_9511Tbl[0]))
#define  COM_LEN_TAB924                 (sizeof(COM_924Tbl)  / sizeof(COM_924Tbl[0]))
/// ------- cy 101007   a   -------

#define  COM_ERR_ONE_TIME               (BSP_LED_Toggle(1))


#define  COM_HGH_NOT_DROP               (MOTO_HGH_POS_UP)

#define  Tangkong_High0                  175
#define  Tangkong_High1                  160
#define  Tangkong_High2                  145
#define  Tangkong_High3                  130
#define  Tangkong_High4                  115
#define  Tangkong_High5                  100
#define  Tangkong_High6                  85
#define  Tangkong_High7                  70
#define  Tangkong_High8                  55
#define  Tangkong_High9                  40
//u8 	Tangkong_High[10]={175,160,145,130,115,100,85,70,55,40};
//u8 	Tangkong_High[10]={45,50,55,60,65,70,75,80,85,90};
u8 	Tangkong_High[10]={15,20,25,30,35,40,45,45,45,45};
/// Exported types -------------------------------------------------------------

typedef  void  COM_EXE_F_TypeDef (u16 buf[], u8 len);

typedef struct {
    u16                 cmd;
    u8                  len;
	u8                  run_sta;
    COM_EXE_F_TypeDef  *DnExe;
    COM_EXE_F_TypeDef  *UpExe;
	
} COM_ITEM_TypeDef;

typedef enum
{
    COM_UP_ST_LOCK      =   0,
    COM_UP_ST_NORMAL,
    COM_UP_ST_BROKEN,
    COM_UP_ST_PATCH_LOCK,
    COM_UP_ST_PATCH_IDLE,
    COM_UP_ST_PATCH_NORMAL,
    COM_UP_ST_PATCH_BROKEN,
//    COM_UP_ST_FAULT,
} COM_UP_ST_TypeDef;


/// for 9511板

/// 9511板地址从1按序排列

/// 回复, 主控接收, 9511发出
typedef enum
{
  	COM_8_RES_BUSY         =   0x12,       /// 忙
    COM_8_RES_SQN_POS      =   0x14,       /// 金片装置导通到位
    COM_8_RES_SQN_NOTPOS,                  /// 金片装置不到位
    COM_8_RES_DAT_ERR      =   0x16,       /// 数据校验错误
    COM_8_RES_EVE_KEYERR   =   0x20,       /// 偶数头机头开关异常(偶下机头撞环)
    COM_8_RES_ODD_KEYERR   =   0x21,       /// 奇数头机头开关异常(奇下机头撞环)
    COM_8_RES_EVE_OVERTIM  =   0x30,       /// 偶数头超时(针高剪线)
    COM_8_RES_ODD_OVERTIM  =   0x31,       /// 奇数头超时(针高剪线)
    COM_8_RES_EVE_REVERSE  =   0x40,       /// 偶数头反转(针高)            
    COM_8_RES_ODD_REVERSE  =   0x41,       /// 奇数头反转(针高)
    COM_8_RES_EVE_BREAK    =   0x50,       /// 偶数头断线
    COM_8_RES_ODD_BREAK    =   0x51,       /// 奇数头断线    
    COM_8_RES_ALL_BREAK    =   0x13,       /// 都断线
    COM_8_RES_EVE_NOTPOS   =   0x60,       /// 偶数头不到位,针高异常(不在档),剪线异常(不在原点)
    COM_8_RES_ODD_NOTPOS   =   0x61,       /// 奇数头不到位,针高异常(不在档),剪线异常(不在原点)
    
} COM_8_RES_TypeDef;



/// for 924板

/// 机头板地址
typedef enum
{
    COM_9_ADDR_DN_NO16     =   0xde,
    COM_9_ADDR_UP_NO16     =   0xdf,
    COM_9_ADDR_DN_COM      =   0xe0,
    COM_9_ADDR_DN_NO1,
    COM_9_ADDR_DN_NO2,
    COM_9_ADDR_DN_NO3,
    COM_9_ADDR_DN_NO4,
    COM_9_ADDR_DN_NO5,
    COM_9_ADDR_DN_NO6,
    COM_9_ADDR_DN_NO7,
    COM_9_ADDR_DN_NO8,
    COM_9_ADDR_DN_NO9,
    COM_9_ADDR_DN_NO10,
    COM_9_ADDR_DN_NO11,
    COM_9_ADDR_DN_NO12,
    COM_9_ADDR_DN_NO13,
    COM_9_ADDR_DN_NO14,
    COM_9_ADDR_DN_NO15,
    COM_9_ADDR_UP_COM      =   0xf0,
    COM_9_ADDR_UP_NO1,
    COM_9_ADDR_UP_NO2,
    COM_9_ADDR_UP_NO3,
    COM_9_ADDR_UP_NO4,
    COM_9_ADDR_UP_NO5,
    COM_9_ADDR_UP_NO6,
    COM_9_ADDR_UP_NO7,
    COM_9_ADDR_UP_NO8,
    COM_9_ADDR_UP_NO9,
    COM_9_ADDR_UP_NO10,
    COM_9_ADDR_UP_NO11,
    COM_9_ADDR_UP_NO12,
    COM_9_ADDR_UP_NO13,
    COM_9_ADDR_UP_NO14,
    COM_9_ADDR_UP_NO15,
    
} COM_9_Addr_TypeDef;

/// 回复, 主控接收, 9511 或 924 发出
typedef enum
{
    COM_9_RES_ODD_NOTPOS   =   0x01,       /// 奇数头不到位
    COM_9_RES_EVE_NOTPOS,                  /// 偶数头不到位
    COM_9_RES_ALL_NOTPOS,                  /// 都不到位
    COM_9_RES_ODD_HGHERR   =   0x04,       /// 奇数头针高异常
    COM_9_RES_EVE_HGHERR,                  /// 偶数头针高异常
    COM_9_RES_ALL_HGHERR,                  /// 都针高异常
    COM_9_RES_ODD_BREAK    =   0x11,       /// 奇数头断线
    COM_9_RES_EVE_BREAK,                   /// 偶数头断线
    COM_9_RES_ALL_BREAK,                   /// 都断线
    COM_9_RES_ODD_KEYERR   =   0x21,       /// 奇数头机头开关异常
    COM_9_RES_EVE_KEYERR,                  /// 偶数头机头开关异常
    COM_9_RES_ALL_KEYERR,                  /// 都机头开关异常
    COM_9_RES_ODD_REVERSE  =   0x31,       /// 奇数头反转(针高)
    COM_9_RES_EVE_REVERSE,                 /// 偶数头反转(针高)
    COM_9_RES_ALL_REVERSE,                 /// 都反转(针高)
    COM_9_RES_ODD_OVERTIM  =   0x41,       /// 奇数头超时(针高剪线)
    COM_9_RES_EVE_OVERTIM,                 /// 偶数头超时(针高剪线)
    COM_9_RES_ALL_OVERTIM,                 /// 都超时(针高剪线)
    COM_9_RES_ODD_DHOVERT  =   0x51,       /// 奇数头超时(DH轴)
    COM_9_RES_EVE_DHOVERT,                 /// 偶数头超时(DH轴)
    COM_9_RES_ALL_DHOVERT,                 /// 都超时(DH轴)
    COM_9_RES_CUTTAP_BUSY  =   0x62,       /// 忙1(剪线Z轴在转动)
    COM_9_RES_DH_BUSY,                     /// 忙2(DH轴在转动)
    COM_9_RES_CRC_ERR,                     /// CRC数据错误
    COM_9_RES_BUSY,                        /// 忙
    COM_9_RES_SQN_POS      =   0x70,       /// 金片装置到位
    COM_9_RES_SQN_NOTPOS,                  /// 金片装置不到位
    COM_9_RES_DN_DATLOSS   =   0x90,       /// 下机头数据丢失
    COM_9_RES_UP_DATLOSS,                  /// 上机头数据丢失

} COM_9_RES_TypeDef;


/// Private variables ----------------------------------------------------------

static  bool                COM_IsFault[BSP_DEVICE_ID_N]    =   {FALSE, FALSE};     /// 故障机头 (上 和 下)
//static  bool              COM_TKFault[BSP_DEVICE_ID_N]    =   {TRUE, TRUE};     /// 故障机头 (上 和 下)
static  bool                COM_DnIsEnable[BSP_DEVICE_ID_N] =   {TRUE,  TRUE};      /// 剪线使能状态 (下)
static  bool                COM_TKIsEnable[BSP_DEVICE_ID_N] =   {FALSE,  FALSE};      /// 剪线使能状态 (下)

static  bool                COM_SwiDirIsEnable[BSP_DEVICE_ID_N] =   {FALSE,  FALSE};      /// 剪线使能状态 (下)
static  COM_UP_ST_TypeDef   COM_UpStNow[BSP_DEVICE_ID_N];
static  COM_UP_ST_TypeDef   COM_UpStLast[BSP_DEVICE_ID_N];                            /// 上机头状态 (上)
static  bool                COM_HghIsAim[BSP_DEVICE_ID_N]   =   {FALSE, FALSE};     /// 针高是否在目标位置 (上)
static  bool                COM_IsHghRest                   =   TRUE;               /// 上电针高静止(上)
  bool                COM_9511IsTset                  =   FALSE;              /// 是否测试状态 (上)(机头灯让给主控)

/// cy  101115  added
/// 正常刺绣时, COM_9511MAIsInOrg = FALSE, COM_9511MAIsRunning = TRUE
/// 越框时,     COM_9511MAIsInOrg = FALSE, COM_9511MAIsRunning = FALSE
/// 上述由主控通讯命令改变, COM_9511MAIsInOrg 与实际意义不符合
static  bool                COM_9511MAIsInOrg               =   FALSE;              /// 主轴是否在零位
static  bool                COM_9511MAIsRunning             =   FALSE;              /// 主轴是否在运转
/// cy  101115  added
static  void  COM_9511SetGreALL (u16 buf[], u8 len);//全变绿灯，主控发指令
static  u8                  COM_WorkHigh                    =   0;                  /// 设定针高值 (上)


static  u16                 COM_9511CheckSum                =   0;                  /// 9511校验和
static  u16                 COM_9511CheckNum                =   0;                  /// 9511校验数据个数
static  bool                COM_9511CheckErr                =   FALSE;              /// 9511校验数据是否错误
bool                COM_9511TangkongDir             =   TRUE;
bool                COM_9511TangkongEnable[2]             =  { TRUE,TRUE};
bool                COM_9511TangkongPatch[2]             =  { 0,0};
static  u8                  COM_Tangkong_WorkHigh           =   0;
static  u8                  COM_Tangkong_WorkHigh_Last      =0;
MOTO_HGH_CMD_TypeDef		COM_Tangkong_WorkCmd;
/// Private function prototypes ------------------------------------------------

COM_EXE_F_TypeDef       COM_CmdDoNothing;

COM_EXE_F_TypeDef       COM_HighTo0;            /// 0x0080
COM_EXE_F_TypeDef       COM_HighTo1;            /// 0x0081
COM_EXE_F_TypeDef       COM_HighTo2;            /// ...
COM_EXE_F_TypeDef       COM_HighTo3;
COM_EXE_F_TypeDef       COM_HighTo4;
COM_EXE_F_TypeDef       COM_HighTo5;
COM_EXE_F_TypeDef       COM_HighTo6;
COM_EXE_F_TypeDef       COM_HighTo7;
COM_EXE_F_TypeDef       COM_HighTo8;
COM_EXE_F_TypeDef       COM_HighTo9;
COM_EXE_F_TypeDef       COM_HighTo10;           /// 0x008a
COM_EXE_F_TypeDef       COM_HeadUpDown;           /// 0x008b
COM_EXE_F_TypeDef       COM_HeadSpeed;           /// 0x008c
COM_EXE_F_TypeDef       COM_9511SetSol;         /// 0x008f
COM_EXE_F_TypeDef		COM_MainSetPssW;	
COM_EXE_F_TypeDef       COM_Tangkong_Action;
COM_EXE_F_TypeDef       COM_Tangkong_Position;
COM_EXE_F_TypeDef       COM_Tangkong_Sta;
COM_EXE_F_TypeDef       COM_Tangkong_SinglDir;
COM_EXE_F_TypeDef       COM_Tangkong_DoublDir;

COM_EXE_F_TypeDef		COM_Tangkong_HighTo0;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo1;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo2;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo3;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo4;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo5;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo6;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo7;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo8;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo9;
COM_EXE_F_TypeDef		COM_Tangkong_HighTo10;


COM_EXE_F_TypeDef		COM_MainErasPssW;	
//COM_EXE_F_TypeDef       COM_9511FaultOff2;       /// 0x00d0
COM_EXE_F_TypeDef		COM_MainCh9511;	   ///0x00ce
COM_EXE_F_TypeDef		COM_MainConfirm;		///0x00cf
//COM_EXE_F_TypeDef       COM_9511DnC2ToUpBrk;      /// 0x00d2
COM_EXE_F_TypeDef       COM_9511FaultOff;       /// 0x00d0
COM_EXE_F_TypeDef       COM_9511DataCheck;      /// 0x00d1
COM_EXE_F_TypeDef       COM_9511DnToUpBrk;      /// 0x00d2
COM_EXE_F_TypeDef       COM_9511BrkDetMod;      /// 0x00d3
COM_EXE_F_TypeDef       COM_9511GetIsSqnUp;     /// 0x00d6
COM_EXE_F_TypeDef       COM_9511DnEnable;       /// 0x00d8
COM_EXE_F_TypeDef       COM_9511CutBack;        /// 0x00d9
COM_EXE_F_TypeDef       COM_9511CutHalf;        /// 0x00da
COM_EXE_F_TypeDef       COM_9511CutFull;        /// 0x00db
COM_EXE_F_TypeDef       COM_9511CutSetPara;     /// 0x00dc
COM_EXE_F_TypeDef       COM_9511GetVersion;     /// 0x00dd
COM_EXE_F_TypeDef       COM_9511SetRedOdd;      /// 0x00de
COM_EXE_F_TypeDef       COM_9511SetGreOdd;      /// 0x00df
COM_EXE_F_TypeDef       COM_9511SetOraOdd;      /// 0x00e0
COM_EXE_F_TypeDef       COM_9511TestEnter;      /// 0x00e1
COM_EXE_F_TypeDef       COM_9511TestExit;       /// 0x00e2
COM_EXE_F_TypeDef       COM_9511SetRedEven;     /// 0x00e3
COM_EXE_F_TypeDef       COM_9511SetGreEven;     /// 0x00e4
COM_EXE_F_TypeDef       COM_9511SetOraEven;     /// 0x00e5
COM_EXE_F_TypeDef       COM_9511MAOrgOut;       /// 0x00e6
COM_EXE_F_TypeDef       COM_9511GetHghOdd;      /// 0x00e7
COM_EXE_F_TypeDef       COM_9511GetHghEven;     /// 0x00e8
COM_EXE_F_TypeDef       COM_9511GetADOdd;       /// 0x00e9
COM_EXE_F_TypeDef       COM_9511GetADEven;      /// 0x00ea
COM_EXE_F_TypeDef       COM_9511MAOneLoop;      /// 0x00eb
COM_EXE_F_TypeDef       COM_9511SetGreALL;      /// 0x00ec
COM_EXE_F_TypeDef       COM_9511PatchExit;      /// 0x00ee
COM_EXE_F_TypeDef       COM_9511PatchEnter;     /// 0x00ef
COM_EXE_F_TypeDef       COM_9511GetHDLed;       /// 0x00f7
COM_EXE_F_TypeDef       COM_9511GetCutOrg;      /// 0x00f8
COM_EXE_F_TypeDef       COM_9511GetDnErr;       /// 0x00f9
COM_EXE_F_TypeDef       COM_9511MAOrgIn;        /// 0x00fa
COM_EXE_F_TypeDef       COM_9511GetUpErr;       /// 0x00fc
COM_EXE_F_TypeDef       COM_9511MAStop;         /// 0x00fd
COM_EXE_F_TypeDef       COM_9511MAStartUp;      /// 0x00fe
COM_EXE_F_TypeDef       COM_9511BrkDetect;      /// 0x00ff
#define HOLD     5
extern u8 UpHeadSpeed;
/// Private consts -------------------------------------------------------------

static  const  COM_ITEM_TypeDef  COM_9511Tbl[]  =   {
    {0x0080,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},           /// 针高0   UP  无数据
    {0x0081,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},           /// 针高1   UP  无数据
    {0x0082,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},           /// ...
    {0x0083,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0084,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0085,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0086,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0087,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0088,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},
    {0x0089,    0,  5,COM_CmdDoNothing,   COM_CmdDoNothing},           /// 针高9   UP  无数据
